<?php
// +----------------------------------------------------------------------
// | oursphp [ simple and fast ]
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: midoks <627293072@qq.com>
// +----------------------------------------------------------------------
$app_debug = false;
if (isset($_GET['debug']) && $_GET['debug'] == 'ok'){
	$app_debug = true;
}

//默认配置文件
return [
	
	//应用名称
	'app_id'	=> 'oursphp_home',
	'app_debug' => $app_debug,
	'app_trace' => true,
	
	// +----------------------------------------------------------------------
    // | 应用设置
    // +----------------------------------------------------------------------

	// 是否支持多模块
    'app_multi_module'       => true,

    'exception_handle' => "\\common\\exception\\Handle",
    
];

?>